app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function index()
    {
        helper(['form']);
        $rules = [
            'username' => 'required|min_length[2]',
            'password' => 'required|min_length[5]'
        ];
        if(!$this->validate($rules)) return $this->fail($this->validator->getErrors());
        $model = new UserModel();
        $user = $model->where('username', $this->request->getVar('username'))->first();