app/Controllers/Register.php

    public function index()
    {
        helper(['form']);
        $rules = [
            'username' => 'required|min_length[2]',
            'fullname' => 'required',
            'password' => 'required|min_length[5]',
        ];
        if(!$this->validate($rules)) return $this->fail($this->validator->getErrors());
        $data = [
            'username' => $this->request->getVar('username'),
            'fullname' => $this->request->getVar('fullname'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
        ];
        $model = new UserModel();
        $registered = $model->save($data);
---
INSERT INTO `users` (`username`, `fullname`, `password`) VALUES ('test coba', 'test', '$2y$10$qENhOX.oSDRaSw.fQsx.6ug98obmAxr8xF4EEXHvf5LNCYhpivtP6')